Tekla Open API Reference for Tekla Structures 2025
Text.TextString Property
 The contents of the text.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string TextString { get; set; }
Public Property TextString As String
	Get
	Set
Property Value
Type: String
See Also
Reference
Text Class
Tekla.Structures.Drawing Namespace